colinporth/stm32F429disco/Src/main.cpp
#define COL_GREEN         0x07E0
//#define COL_LIGHTGREEN    0xFF80FF80
//#define COL_DARKGREEN     0xFF008000
//#define COL_DARKERGREEN   0xFF004000

#define COL_RED           0xF800
//#define COL_LIGHTRED      0xFFFF8080
//#define COL_DARKRED       0xFF800000

#define COL_CYAN          0x07FF
//#define COL_LIGHTCYAN     0xFF80FFFF
//#define COL_DARKCYAN      0xFF008080

#define COL_MAGENTA       0xF81F
//#define COL_LIGHTMAGENTA  0xFFFF80FF
//#define COL_DARKMAGENTA   0xFF800080

#define COL_YELLOW        0xFFE0
//#define COL_LIGHTYELLOW   0xFFFFFF80
//#define COL_DARKYELLOW    0xFF808000
//#define COL_DARKERYELLOW  0xFF202000

//#define COL_BROWN         0xFFA52A2A
//#define COL_ORANGE        0xFFFFA500
//#define COL_DARKORANGE    0xFFC07800
//#define COL_DARKERORANGE  0xFF805000
//}}}
//{{{  lcd vars
const int kEnd = 0;
const int kStamp = 1;

#define DMA2D_BUFFER         0x10000000
#define DMA2D_BUFFER_SIZE        0x9000  // SIZE = rest of dtcm

class cLcd;
cLcd* lcd = nullptr;

//{{{  struct tLTDC
typedef struct {
  //SemaphoreHandle_t sem;
  uint32_t timeouts;
  uint32_t lineIrq;
  uint32_t fifoUnderunIrq;
  uint32_t transferErrorIrq;
  uint32_t lastTicks;
  uint32_t lineTicks;
  uint32_t frameWait;
  } tLTDC;
//}}}
tLTDC ltdc;

uint8_t showAlpha[2];
uint32_t showFrameBufferAddress[2];

uint32_t* mDma2dBuf = nullptr;
uint32_t* mDma2dIsrBuf = nullptr;
//}}}

uint16_t getFontHeight() { return 26; }
uint16_t getBigFontHeight() { return 40; }
uint16_t getSmallFontHeight() { return 12; }
uint16_t getBoxHeight() { return 30; }
//{{{
void LCD_DMA2D_IRQHandler() {

  // clear interrupts
  DMA2D->IFCR = DMA2D_ISR_TCIF | DMA2D_ISR_TEIF | DMA2D_ISR_CEIF;

  while (true) {
    uint32_t opcode = *mDma2dIsrBuf++;
    switch (opcode) {
      case kStamp:
        DMA2D->FGPFCCR = DMA2D_INPUT_A8;  // fgnd PFC
        DMA2D->BGPFCCR = DMA2D_INPUT_RGB565;
        DMA2D->OPFCCR  = DMA2D_INPUT_RGB565;
        DMA2D->OMAR    = *mDma2dIsrBuf;   // output start address
        DMA2D->BGMAR   = *mDma2dIsrBuf++; // - repeated to bgnd start addres
        DMA2D->OOR     = *mDma2dIsrBuf;   // output stride
        DMA2D->BGOR    = *mDma2dIsrBuf++; // - repeated to bgnd stride
        DMA2D->NLR     = *mDma2dIsrBuf++; // width:height
        DMA2D->FGMAR   = *mDma2dIsrBuf++; // fgnd start address
        DMA2D->FGOR    = 0;               // fgnd stride
        DMA2D->CR = DMA2D_M2M_BLEND | DMA2D_CR_TCIE | DMA2D_CR_TEIE | DMA2D_CR_CEIE | DMA2D_CR_START;
        while (!(DMA2D->ISR & DMA2D_FLAG_TC)) {}
        DMA2D->IFCR |= DMA2D_IFSR_CTEIF | DMA2D_IFSR_CTCIF | DMA2D_IFSR_CTWIF|
                       DMA2D_IFSR_CCAEIF | DMA2D_IFSR_CCTCIF | DMA2D_IFSR_CCEIF;
        break;

      case kEnd: {
        DMA2D->CR = 0;
        // reset opcode buffer
        mDma2dIsrBuf = mDma2dBuf;
        return;
        }

      default: // opcode==address : value
        *(uint32_t*)opcode = *mDma2dIsrBuf++;
        if (opcode == (uint32_t)DMA2D) { // address of CR
          while (!(DMA2D->ISR & DMA2D_FLAG_TC)) {}
          DMA2D->IFCR |= DMA2D_IFSR_CTEIF | DMA2D_IFSR_CTCIF | DMA2D_IFSR_CTWIF|
                         DMA2D_IFSR_CCAEIF | DMA2D_IFSR_CCTCIF | DMA2D_IFSR_CCEIF;
         break;
         }
      }
    }
  }
//}}}

class cLcd {
public:
  //{{{  struct tTile
  typedef struct {
    uint32_t base;
    uint16_t pitch;
    uint16_t format;
    uint16_t components;
    uint16_t x;
    uint16_t y;
    uint16_t width;
    uint16_t height;
    } tTile;
  //}}}
  //{{{
  cLcd (uint32_t buffer0, uint32_t buffer1)  {

    mBuffer[false] = buffer0;
    mBuffer[true] = buffer1;
    updateNumDrawLines();
    }
  //}}}
  ~cLcd() {}
  //{{{
  void init (std::string title) {

    mDrawBuffer = !mDrawBuffer;
    ltdcInit (mBuffer[mDrawBuffer]);

    // zero out first opcode, point past it
    mDma2dBuf = (uint32_t*)DMA2D_BUFFER;
    mDma2dIsrBuf = mDma2dBuf;
    mDma2dCurBuf = mDma2dBuf;
    *mDma2dCurBuf = kEnd;

    // dma2d IRQ init
    //HAL_NVIC_SetPriority (DMA2D_IRQn, 0x0F, 0);
    //HAL_NVIC_EnableIRQ (DMA2D_IRQn);

    // font init
    FT_Init_FreeType (&FTlibrary);
    FT_New_Memory_Face (FTlibrary, (FT_Byte*)freeSansBold, sizeof (freeSansBold), 0, &FTface);
    FTglyphSlot = FTface->glyph;

    // preload fontChars
    for (char ch = 0x20; ch <= 0x7F; ch++)
      loadChar (getFontHeight(), ch);
    //for (char ch = 0x21; ch <= 0x3F; ch++)
    //  loadChar (getBigFontHeight(), ch);
    //for (char ch = 0x21; ch <= 0x3F; ch++)
    //  loadChar (getSmallFontHeight(), ch);

    FT_Done_Face (FTface);
    //FT_Done_FreeType (FTlibrary);

    mTitle = title;
    updateNumDrawLines();
    }
  //}}}

  uint16_t getLcdWidthPix() { return 800; }
  uint16_t getLcdHeightPix() { return 1280; }

  //{{{
  void setShowDebug (bool title, bool info, bool lcdStats, bool footer) {

    mShowTitle = title;
    mShowInfo = info;
    mShowLcdStats = lcdStats;
    mShowFooter = footer;

    updateNumDrawLines();
    }
  //}}}
  //{{{
  void debug (std::string str) {
    info (COL_WHITE, str);
    render();
    }
  //}}}
  //{{{
  void info (std::string str) {
    info (COL_WHITE, str);
    }
  //}}}
  //{{{
  void info (uint16_t colour, std::string str) {

    bool tailing = mLastLine == (int)mFirstLine + mNumDrawLines - 1;

    auto line = (mLastLine < mMaxLine-1) ? mLastLine+1 : mLastLine;
    mLines[line].mTime = HAL_GetTick(); //xTaskGetTickCount();
    mLines[line].mColour = colour;
    mLines[line].mString = str;
    mLastLine = line;

    if (tailing)
      mFirstLine = mLastLine - mNumDrawLines + 1;
    }
  //}}}

  //{{{
  void press (int pressCount, int16_t x, int16_t y, uint16_t z, int16_t xinc, int16_t yinc) {

    if ((pressCount > 30) && (x <= mStringPos) && (y <= getBoxHeight()))
      reset();
    else if (pressCount == 0) {
      if (x <= mStringPos) {
        // set displayFirstLine
        if (y < 2 * getBoxHeight())
          displayTop();
        else if (y > getLcdHeightPix() - 2 * getBoxHeight())
          displayTail();
        }
      }
    else {
      // inc firstLine
      float value = mFirstLine - ((2.0f * yinc) / getBoxHeight());

