colinporth/stm32F429disco/Src/main.cpp
      if (value < 0)
        mFirstLine = 0;
      else if (mLastLine <= (int)mNumDrawLines-1)
        mFirstLine = 0;
      else if (value > mLastLine - mNumDrawLines + 1)
        mFirstLine = mLastLine - mNumDrawLines + 1;
      else
        mFirstLine = value;
      }
    }
  //}}}
  //{{{
  void startRender() {

    mDrawBuffer = !mDrawBuffer;
    setLayer (0, mBuffer[mDrawBuffer]);

    // frameSync;
    //ltdc.frameWait = 1;
    //if (xSemaphoreTake (ltdc.sem, 100) == pdFALSE)
    //  ltdc.timeouts++;

    mDrawStartTime = HAL_GetTick();
    }
  //}}}
  //{{{
  void renderCursor (uint16_t colour, int16_t x, int16_t y, int16_t z) {
    ellipse (colour, x, y, z, z);
    }
  //}}}
  //{{{
  void endRender (bool forceInfo) {

    auto y = 0;
    if ((mShowTitle || forceInfo) && !mTitle.empty()) {
      //{{{  draw title
      text (COL_YELLOW, getFontHeight(), mTitle, 0, y, getLcdWidthPix(), getBoxHeight());
      y += getBoxHeight();
      }
      //}}}
    if (mShowInfo || forceInfo) {
      //{{{  draw info lines
      if (mLastLine >= 0) {
        // draw scroll bar
        auto yorg = getBoxHeight() + ((int)mFirstLine * mNumDrawLines * getBoxHeight() / (mLastLine + 1));
        auto height = mNumDrawLines * mNumDrawLines * getBoxHeight() / (mLastLine + 1);
        rectClipped (COL_YELLOW, 0, yorg, 8, height);
        }

      auto lastLine = (int)mFirstLine + mNumDrawLines - 1;
      if (lastLine > mLastLine)
        lastLine = mLastLine;

      for (auto lineIndex = (int)mFirstLine; lineIndex <= lastLine; lineIndex++) {
        auto x = 0;
        auto xinc = text (COL_GREEN, getFontHeight(),
                          dec ((mLines[lineIndex].mTime-mStartTime) / 1000) + "." +
                          dec ((mLines[lineIndex].mTime-mStartTime) % 1000, 3, '0'),
                          x, y, getLcdWidthPix(), getBoxHeight());
        x += xinc + 3;

        text (mLines[lineIndex].mColour, getFontHeight(), mLines[lineIndex].mString,
              x, y, getLcdWidthPix()-x, getLcdHeightPix());

        y += getBoxHeight();
        }
      }
      //}}}
    if (mShowLcdStats) {
      //{{{  draw lcdStats
      std::string str = dec (ltdc.lineIrq) + ":f " +
                        dec (ltdc.lineTicks) + "ms " +
                        dec (mDma2dTimeouts) + " " +
                        dec (ltdc.transferErrorIrq) + " " +
                        dec (ltdc.fifoUnderunIrq);
      text (COL_WHITE, getFontHeight(), str, 0, getLcdHeightPix() - 2 * getBoxHeight(), getLcdWidthPix(), 24);
      }
      //}}}
    if (mShowFooter || forceInfo)
      //{{{  draw footer
      text (COL_WHITE, getFontHeight(),
            //dec (xPortGetFreeHeapSize()) + " " +
            //dec (xPortGetMinimumEverFreeHeapSize()) + " " +
            //dec (osGetCPUUsage()) + "% " +
          dec (mDrawTime) + "ms " + dec (mDma2dCurBuf - mDma2dBuf),
            0, -getFontHeight() + getLcdHeightPix(), getLcdWidthPix(), getFontHeight());
      //}}}

    // terminate opCode buffer, send it
    *mDma2dCurBuf = kEnd;
    LCD_DMA2D_IRQHandler();
    mDma2dCurBuf = mDma2dBuf;

    // show it
    showLayer (0, mBuffer[mDrawBuffer], 255);

    mDrawTime = HAL_GetTick() - mDrawStartTime;
    }
  //}}}
  //{{{
  void render() {
    startRender();
    clear (COL_BLACK);
    endRender (true);
    }
  //}}}
  //{{{
  void flush() {

    *mDma2dCurBuf = kEnd;
    LCD_DMA2D_IRQHandler();
    mDma2dCurBuf = mDma2dBuf;
    }
  //}}}

  //{{{
  void displayOn() {
    GPIOD->BSRR = GPIO_PIN_13;   // ADJ hi
    }
  //}}}
  //{{{
  void displayOff() {
    GPIOD->BSRR = GPIO_PIN_13 << 16;   // ADJ lo
    }
  //}}}

  //{{{
  void pixel (uint16_t colour, int16_t x, int16_t y) {

    rect (colour, x, y, 1, 1);
    }
  //}}}
  //{{{
  void rect (uint16_t colour, int16_t x, int16_t y, uint16_t width, uint16_t height) {

    // often same colour
    if (colour != mCurDstColour) {
      *mDma2dCurBuf++ = (uint32_t)&(DMA2D->OCOLR); // OCOLR - output colour
      *mDma2dCurBuf++ = colour;
      mCurDstColour = colour;
      }

    // quite often same stride
    if (uint32_t(getLcdWidthPix() - width) != mDstStride) {
      *mDma2dCurBuf++ = (uint32_t)&(DMA2D->OOR); // OOR - output stride
      mDstStride = getLcdWidthPix() - width;
      *mDma2dCurBuf++ = mDstStride;
      }

    *mDma2dCurBuf++ = (uint32_t)&(DMA2D->OMAR); // OMAR - output start address 3c
    *mDma2dCurBuf++ = mCurFrameBufferAddress + ((y * getLcdWidthPix()) + x) * dstComponents;

    *mDma2dCurBuf++ = (uint32_t)&(DMA2D->NLR);
    *mDma2dCurBuf++ = (width << 16) | height;

    *mDma2dCurBuf++ = (uint32_t)DMA2D; // CR
    *mDma2dCurBuf++ = DMA2D_R2M | DMA2D_CR_TCIE | DMA2D_CR_TEIE | DMA2D_CR_CEIE | DMA2D_CR_START;
    }
  //}}}
  //{{{
  void stamp (uint16_t colour, uint8_t* src, int16_t x, int16_t y, uint16_t width, uint16_t height) {

    // often same colour
    if (colour != mCurSrcColour) {
      uint32_t fullColour = ((colour & 0xF800) << 8) | ((colour & 0x07E0) << 5) | ((colour & 0x001F) << 3);
      *mDma2dCurBuf++ = (uint32_t)&(DMA2D->FGCOLR); // FGCOLR - fgnd colour
      *mDma2dCurBuf++ = fullColour;
      mCurSrcColour = colour;
      }

    *mDma2dCurBuf++ = kStamp;
    *mDma2dCurBuf++ = mCurFrameBufferAddress + ((y * getLcdWidthPix()) + x) * dstComponents; // output start address
    mDstStride = getLcdWidthPix() - width;
    *mDma2dCurBuf++ = mDstStride;                                          // stride
    *mDma2dCurBuf++ = (width << 16) | height;                              // width:height
    *mDma2dCurBuf++ = (uint32_t)src;                                       // fgnd start address
    }
  //}}}
  //{{{
  int text (uint16_t colour, uint16_t fontHeight, std::string str, int16_t x, int16_t y, uint16_t width, uint16_t height) {

    auto xend = x + width;
    for (uint16_t i = 0; i < str.size(); i++) {
      if ((str[i] >= 0x20) && (str[i] <= 0x7F)) {
        auto fontCharIt = mFontCharMap.find (fontHeight<<8 | str[i]);
        if (fontCharIt != mFontCharMap.end()) {
          auto fontChar = fontCharIt->second;
          if (x + fontChar->left + fontChar->pitch >= xend)
            break;
          else if (fontChar->bitmap)
            stampClipped (colour, fontChar->bitmap, x + fontChar->left, y + fontHeight - fontChar->top, fontChar->pitch, fontChar->rows);

          x += fontChar->advance;
          }
        }
      }

    return x;
    }
  //}}}

