colinporth/stm32F429disco/Src/main.cpp
    mDstStride = getLcdWidthPix() - srcTile->width;
    *mDma2dCurBuf++ = (uint32_t)&(DMA2D->OOR); // OOR - output stride
    *mDma2dCurBuf++ = mDstStride;

    *mDma2dCurBuf++ = (uint32_t)&(DMA2D->NLR); // NLR - width:height
    *mDma2dCurBuf++ = (srcTile->width << 16) | srcTile->height;

    *mDma2dCurBuf++ = (uint32_t)DMA2D;        // CR
    *mDma2dCurBuf++ = DMA2D_M2M_PFC | DMA2D_CR_TCIE | DMA2D_CR_TEIE | DMA2D_CR_CEIE | DMA2D_CR_START;
    }
  //}}}
  //{{{
  void copy90 (tTile* srcTile, int16_t x, int16_t y) {

    // src - fgnd
    *mDma2dCurBuf++ = (uint32_t)&(DMA2D->FGPFCCR); // FGPFCCR - fgnd PFC
    *mDma2dCurBuf++ = srcTile->format;

    *mDma2dCurBuf++ = (uint32_t)&(DMA2D->NLR); // NLR - width:height
    *mDma2dCurBuf++ = 0x10000 | (srcTile->width);

    *mDma2dCurBuf++ = (uint32_t)&(DMA2D->FGOR); // FGOR - fgnd stride
    *mDma2dCurBuf++ = 0;

    // output
    mDstStride = getLcdWidthPix() - 1;
    *mDma2dCurBuf++ = (uint32_t)&(DMA2D->OOR); // OOR - output stride
    *mDma2dCurBuf++ = mDstStride;

    for (int line = 0; line < srcTile->height; line++) {
      *mDma2dCurBuf++ = (uint32_t)&(DMA2D->OMAR); // OMAR - output start address
      *mDma2dCurBuf++ = mCurFrameBufferAddress + (line * dstComponents);

      *mDma2dCurBuf++ = (uint32_t)&(DMA2D->FGMAR); // FGMAR - fgnd address
      *mDma2dCurBuf++ = (uint32_t)srcTile->base + (line * srcTile->width * srcTile->components);

      *mDma2dCurBuf++ = (uint32_t)DMA2D;        // CR
      *mDma2dCurBuf++ = DMA2D_M2M_PFC | DMA2D_CR_TCIE | DMA2D_CR_TEIE | DMA2D_CR_CEIE | DMA2D_CR_START;
      }

    }
  //}}}
  //{{{
  void size (tTile* srcTile, int16_t x, int16_t y, uint16_t width, uint16_t height) {
  // do size with 90 rotate

    uint32_t tmpBuf = (uint32_t)pvPortMalloc (srcTile->width * height * tmpComponents);

    // first pass
    uint32_t srcBase = srcTile->base + ((srcTile->y * srcTile->pitch) + srcTile->x) * srcTile->components;
    uint32_t blendCoeff = ((srcTile->height-1) << 21) / height;
    uint32_t blendIndex = blendCoeff >> 1;
    uint16_t srcPitch = srcTile->pitch * srcTile->components;
    uint32_t srcPtr = srcBase + (blendIndex >> 21) * srcPitch;
    uint32_t srcPtr1 = srcPtr + srcPitch;
    uint32_t dstPtr = tmpBuf;
    uint32_t fccr = srcTile->format | ((blendIndex >> 13) << 24);
    uint16_t dstPitch = tmpComponents;
    mDstStride = height - 1;

    DMA2D->BGPFCCR = 0xff000000 | srcTile->format;
    DMA2D->OPFCCR = tmpFormat;
    DMA2D->NLR = 0x10000 | srcTile->width;
    DMA2D->FGOR = 0;
    DMA2D->BGOR = 0;
    DMA2D->OOR = mDstStride;
    for (int i = 0; i < height; i++) {
      //{{{  loop lines, src -> tmp
      DMA2D->BGMAR = srcPtr;
      DMA2D->FGMAR = srcPtr1;
      DMA2D->OMAR = dstPtr;
      DMA2D->FGPFCCR = fccr;

      DMA2D->CR = DMA2D_M2M_BLEND | DMA2D_CR_TCIE | DMA2D_CR_TEIE | DMA2D_CR_CEIE | DMA2D_CR_START;

      blendIndex += blendCoeff;
      fccr = srcTile->format | ((blendIndex >> 13) << 24);
      srcPtr = srcBase + (blendIndex >> 21) * srcPitch;
      srcPtr1 = srcPtr + srcPitch;
      dstPtr += dstPitch;

      while (!(DMA2D->ISR & DMA2D_FLAG_TC)) {}
      DMA2D->IFCR |= DMA2D_IFSR_CTEIF | DMA2D_IFSR_CTCIF | DMA2D_IFSR_CTWIF|
                     DMA2D_IFSR_CCAEIF | DMA2D_IFSR_CCTCIF | DMA2D_IFSR_CCEIF;
      }
      //}}}

    // second pass
    srcBase = tmpBuf;
    blendCoeff = ((srcTile->width-1) << 21) / width;
    blendIndex = blendCoeff >> 1;
    srcPitch = height * tmpComponents;
    srcPtr = srcBase + (blendIndex >> 21) * srcPitch;
    srcPtr1 = srcPtr + srcPitch;
    dstPtr = mCurFrameBufferAddress + (((y * getLcdWidthPix()) + x) * dstComponents);
    fccr = tmpFormat | ((blendIndex >> 13) << 24);
    dstPitch = dstComponents;
    mDstStride = width - 1;

    DMA2D->BGPFCCR = 0xff000000 | tmpFormat;
    DMA2D->OPFCCR  = dstFormat;
    DMA2D->NLR = 0x10000 | height;
    DMA2D->FGOR = 0;
    DMA2D->BGOR = 0;
    DMA2D->OOR = mDstStride;
    for (int i = 0; i < width; i++) {
      //{{{  loop columns, tmp -> dst
      DMA2D->BGMAR = srcPtr;
      DMA2D->FGMAR = srcPtr1;
      DMA2D->OMAR = dstPtr;
      DMA2D->FGPFCCR = fccr;

      DMA2D->CR = DMA2D_M2M_BLEND | DMA2D_CR_TCIE | DMA2D_CR_TEIE | DMA2D_CR_CEIE | DMA2D_CR_START;

      blendIndex += blendCoeff;
      fccr = tmpFormat | ((blendIndex >> 13) << 24);
      srcPtr = srcBase + (blendIndex >> 21) * srcPitch;
      srcPtr1 = srcPtr + srcPitch;
      dstPtr += dstPitch;

      while (!(DMA2D->ISR & DMA2D_FLAG_TC)) {}
      DMA2D->IFCR |= DMA2D_IFSR_CTEIF | DMA2D_IFSR_CTCIF | DMA2D_IFSR_CTWIF|
                     DMA2D_IFSR_CCAEIF | DMA2D_IFSR_CCTCIF | DMA2D_IFSR_CCEIF;
      }
      //}}}

    vPortFree ((void*)tmpBuf);
    }
  //}}}
  //{{{
  void sizeCpu (tTile* srcTile, int16_t x, int16_t y, uint16_t width, uint16_t height) {

    uint32_t srcIncx = (srcTile->width << 16) / width;
    uint32_t srcIncy = (srcTile->height << 16) / height;

    uint32_t srcy = 0;
    uint16_t* dstBase = (uint16_t*)(mCurFrameBufferAddress) + (y * getLcdWidthPix()) + x;
    if (srcTile->format == DMA2D_RGB565) {
      uint16_t* srcBase = (uint16_t*)(srcTile->base) + (srcTile->y * srcTile->pitch) + srcTile->x;
      for (int j = 0; j < height; j++) {
        uint16_t* srcLineBase = srcBase + ((srcy >> 16) * srcTile->pitch);
        uint16_t* dstPtr = dstBase + (j * getLcdWidthPix());
        for (uint32_t srcx = 0; srcx < width * srcIncx; srcx += srcIncx)
          *dstPtr++ = *(srcLineBase + (srcx >> 16));
        srcy += srcIncy;
        }
      }
    else {
      uint8_t* srcBase = (uint8_t*)(srcTile->base + ((srcTile->y * srcTile->pitch) + srcTile->x) * srcTile->components);
      for (int j = 0; j < height; j++) {
        uint32_t srcx = 0;
        uint8_t* srcLineBase = srcBase + ((srcy >> 16) * srcTile->pitch) * srcTile->components;
        uint16_t* dstPtr = dstBase + (j * getLcdWidthPix());
        for (int i = 0; i < width; i++) {
          uint8_t* srcPtr = srcLineBase + (srcx >> 16) * srcTile->components;
          *dstPtr++ = ((*srcPtr++) >> 3) | (((*srcPtr++) & 0xFC) << 3) | (((*srcPtr) & 0xF8) << 8);
          srcx += srcIncx;
          }
        srcy += srcIncy;
        }
      }
    }
  //}}}

