colinporth/stm32F429disco/Src/main.cpp
private:
  const uint32_t dstFormat = DMA2D_RGB565;
  const uint16_t dstComponents = 2;
  const uint32_t tmpFormat = DMA2D_RGB565;
  const uint16_t tmpComponents = 2;

  //{{{
  class cFontChar {
  public:
    uint8_t* bitmap;
    int16_t left;
    int16_t top;
    int16_t pitch;
    int16_t rows;
    int16_t advance;
    };
  //}}}
  typedef std::map<uint16_t, cFontChar*> cFontCharMap;

  //{{{
  void ltdcInit (uint32_t frameBufferAddress) {

    //{{{  clocks
    __HAL_RCC_GPIOA_CLK_ENABLE();
    __HAL_RCC_GPIOB_CLK_ENABLE();
    __HAL_RCC_GPIOC_CLK_ENABLE();
    __HAL_RCC_GPIOD_CLK_ENABLE();
    __HAL_RCC_GPIOF_CLK_ENABLE();
    __HAL_RCC_GPIOG_CLK_ENABLE();

    __HAL_RCC_DMA2D_CLK_ENABLE();
    __HAL_RCC_LTDC_CLK_ENABLE();
    //}}}
    //{{{  gpio
    //  CK <-> PG.07   DE <-> PF.10  ADJ <-> PD.13 - optional HS <-> PC.06, VS <-> PA.04
    //  R2 <-> PC.10   G2 <-> PA.06   B2 <-> PD.06
    //  R3 <-> PB.00   G3 <-> PG.10   B3 <-> PG.11
    //  R4 <-> PA.11   G4 <-> PB.10   B4 <-> PG.12
    //  R5 <-> PA.12   G5 <-> PB.11   B5 <-> PA.03
    //  R6 <-> PB.01   G6 <-> PC.07   B6 <-> PB.08
    //  R7 <-> PG.06   G7 <-> PD.03   B7 <-> PB.09

    GPIO_InitTypeDef GPIO_InitStructure;
    GPIO_InitStructure.Mode = GPIO_MODE_OUTPUT_PP;
    //GPIO_InitStructure.Pull = GPIO_NOPULL;
    GPIO_InitStructure.Speed = GPIO_SPEED_FREQ_HIGH;
    GPIO_InitStructure.Pin = GPIO_PIN_13;
    HAL_GPIO_Init (GPIOD, &GPIO_InitStructure);

    GPIO_InitStructure.Mode = GPIO_MODE_AF_PP;
    GPIO_InitStructure.Pull = GPIO_NOPULL;
    GPIO_InitStructure.Speed = GPIO_SPEED_FREQ_HIGH;
    GPIO_InitStructure.Alternate = GPIO_AF14_LTDC;

    GPIO_InitStructure.Pin = GPIO_PIN_3 | GPIO_PIN_6 | GPIO_PIN_11 | GPIO_PIN_12; // GPIO_PIN_4
    HAL_GPIO_Init (GPIOA, &GPIO_InitStructure);

    GPIO_InitStructure.Pin = GPIO_PIN_8 | GPIO_PIN_9 | GPIO_PIN_10 | GPIO_PIN_11;
    HAL_GPIO_Init (GPIOB, &GPIO_InitStructure);

    GPIO_InitStructure.Pin = GPIO_PIN_7;// ; | GPIO_PIN_10; // GPIO_PIN_6
    HAL_GPIO_Init (GPIOC, &GPIO_InitStructure);

    GPIO_InitStructure.Pin = GPIO_PIN_3 | GPIO_PIN_6;
    HAL_GPIO_Init (GPIOD, &GPIO_InitStructure);

    GPIO_InitStructure.Pin = GPIO_PIN_10;
    HAL_GPIO_Init (GPIOF, &GPIO_InitStructure);

    GPIO_InitStructure.Pin = GPIO_PIN_6 | GPIO_PIN_7 | GPIO_PIN_11;
    HAL_GPIO_Init (GPIOG, &GPIO_InitStructure);

    GPIO_InitStructure.Pin = GPIO_PIN_0 | GPIO_PIN_1;
    GPIO_InitStructure.Alternate= GPIO_AF9_LTDC;
    HAL_GPIO_Init (GPIOB, &GPIO_InitStructure);

    GPIO_InitStructure.Pin = GPIO_PIN_10 | GPIO_PIN_12;
    HAL_GPIO_Init (GPIOG, &GPIO_InitStructure);
    //}}}

    #define LCD_WIDTH   800  // min 39Mhz typ 45Mhz max 51.42Mhz
    #define LCD_HEIGHT 1280
    #define HORIZ_SYNC   64  // min  136  typ 176   max 216
    #define VERT_SYNC     1  // min   12  typ  25   max  38

    LtdcHandler.Instance = LTDC;
    LtdcHandler.Init.HorizontalSync     = HORIZ_SYNC - 1;
    LtdcHandler.Init.AccumulatedHBP     = HORIZ_SYNC - 1;
    LtdcHandler.Init.AccumulatedActiveW = HORIZ_SYNC + LCD_WIDTH - 1;
    LtdcHandler.Init.TotalWidth         = HORIZ_SYNC + LCD_WIDTH - 1;
    LtdcHandler.Init.VerticalSync       = VERT_SYNC - 1;
    LtdcHandler.Init.AccumulatedVBP     = VERT_SYNC - 1;
    LtdcHandler.Init.AccumulatedActiveH = VERT_SYNC + LCD_HEIGHT - 1;
    LtdcHandler.Init.TotalHeigh         = VERT_SYNC + LCD_HEIGHT - 1;
    LtdcHandler.Init.HSPolarity = LTDC_HSPOLARITY_AL;
    LtdcHandler.Init.VSPolarity = LTDC_VSPOLARITY_AL;
    LtdcHandler.Init.DEPolarity = LTDC_DEPOLARITY_AL;
    LtdcHandler.Init.PCPolarity = LTDC_PCPOLARITY_IPC;
    LtdcHandler.Init.Backcolor.Red = 0;
    LtdcHandler.Init.Backcolor.Blue = 0;
    LtdcHandler.Init.Backcolor.Green = 0;
    HAL_LTDC_Init (&LtdcHandler);

    //DMA2D->AMTCR = 0x3F01;

    layerInit (0, frameBufferAddress);
    mSetFrameBufferAddress[1] = frameBufferAddress;
    showFrameBufferAddress[1] = frameBufferAddress;
    showAlpha[1] = 0;

    ltdc.timeouts = 0;
    ltdc.lineIrq = 0;
    ltdc.fifoUnderunIrq = 0;
    ltdc.transferErrorIrq = 0;
    ltdc.lastTicks = 0;
    ltdc.lineTicks = 0;
    ltdc.frameWait = 0;

    //vSemaphoreCreateBinary (ltdc.sem);

   // HAL_NVIC_SetPriority (LTDC_IRQn, 0xE, 0);
   // HAL_NVIC_EnableIRQ (LTDC_IRQn);

    // set line interupt line number
    //LTDC->LIPCR = 0;

    // enable line interrupt
    //LTDC->IER |= LTDC_IT_LI;
    }
  //}}}
  //{{{
  void layerInit (uint8_t layer, uint32_t frameBufferAddress) {

    LTDC_LayerCfgTypeDef* curLayerCfg = &LtdcHandler.LayerCfg[layer];

    curLayerCfg->WindowX0 = 0;
    curLayerCfg->WindowX1 = getLcdWidthPix();
    curLayerCfg->WindowY0 = 0;
    curLayerCfg->WindowY1 = getLcdHeightPix();

    curLayerCfg->PixelFormat = LTDC_PIXEL_FORMAT_RGB565;

    curLayerCfg->FBStartAdress = (uint32_t)frameBufferAddress;

    curLayerCfg->Alpha = 255;
    curLayerCfg->Alpha0 = 0;

    curLayerCfg->Backcolor.Blue = 0;
    curLayerCfg->Backcolor.Green = 0;
    curLayerCfg->Backcolor.Red = 0;

    curLayerCfg->BlendingFactor1 = LTDC_BLENDING_FACTOR1_PAxCA;
    curLayerCfg->BlendingFactor2 = LTDC_BLENDING_FACTOR2_PAxCA;

    curLayerCfg->ImageWidth = getLcdWidthPix();
    curLayerCfg->ImageHeight = getLcdHeightPix();

    HAL_LTDC_ConfigLayer (&LtdcHandler, curLayerCfg, layer);

    // local state
    mCurFrameBufferAddress = frameBufferAddress;
    mSetFrameBufferAddress[layer] = frameBufferAddress;
    showFrameBufferAddress[layer] = frameBufferAddress;
    showAlpha[layer] = 255;
    }
  //}}}
  //{{{
  void setLayer (uint8_t layer, uint32_t frameBufferAddress) {

    mCurFrameBufferAddress = frameBufferAddress;
    mSetFrameBufferAddress[layer] = frameBufferAddress;
    }
  //}}}
  //{{{
  void showLayer (uint8_t layer, uint32_t frameBufferAddress, uint8_t alpha) {

    showFrameBufferAddress[layer] = frameBufferAddress;
    showAlpha[layer] = alpha;

    LTDC_Layer_TypeDef* ltdcLayer = (LTDC_Layer_TypeDef*)((uint32_t)LTDC + 0x84); // + (0x80*layer));
    ltdcLayer->CFBAR = showFrameBufferAddress[0];
    if (showAlpha[0]) {
      ltdcLayer->CR |= LTDC_LxCR_LEN;
      ltdcLayer->CACR &= ~LTDC_LxCACR_CONSTA;
      ltdcLayer->CACR = showAlpha[0];
      }
    else
      ltdcLayer->CR &= ~LTDC_LxCR_LEN;
    LTDC->SRCR |= LTDC_SRCR_IMR;
    }
  //}}}

