colinporth/stm32F429disco/Src/main.cpp
  //lcd->info ("dir " + directoryName);
  //lcd->render();

  cDirectory directory (directoryName);
  if (directory.getError()) {
    //{{{  open error
    lcd->info (COL_RED, "directory open error:"  + dec (directory.getError()));
    return;
    }
    //}}}

  cFileInfo fileInfo;
  while ((directory.find (fileInfo) == FR_OK) && !fileInfo.getEmpty()) {
    if (fileInfo.getBack()) {
      //debug (fileInfo.getName());
      }

    else if (fileInfo.isDirectory()) {
      listDirectory (directoryName + "/" + fileInfo.getName(), ext);
      }
    else if (fileInfo.matchExtension (ext.c_str())) {
      mFileNames.push_back (directoryName + "/" + fileInfo.getName());
      //lcd->info (fileInfo.getName());
      //lcd->render();
      }
    }
  }
//}}}
//{{{
int main() {

  HAL_Init();
  SystemClockConfig180();
  initDebugUart();
  BSP_PB_Init (BUTTON_KEY, BUTTON_MODE_GPIO);
  //configureDtrace4();
  SDRAMgpioInit();
  SDRAMbank1Init();
  SDRAMbank2Init();

  HeapRegion_t xHeapRegions[] = { {(uint8_t*)SDRAM_BANK2_ADDR + 0x400000, 0x400000 }, { nullptr, 0 } };
  heapInit (xHeapRegions);
  //{{{  init frameBuffer
  memset ((void*)SDRAM_BANK2_ADDR, 0, 0x400000);

  lcd = new cLcd (SDRAM_BANK2_ADDR, SDRAM_BANK2_ADDR + 0x200000);
  const std::string kHello = "built " + std::string(__TIME__) + " on " + std::string(__DATE__);
  lcd->init ("stm32F429disco test - " + kHello);
  lcd->displayOn();
  lcd->render();
  //}}}
  if (BSP_PB_GetState (BUTTON_KEY) == GPIO_PIN_SET) {
    //{{{  ps2
    initPs2gpio();
    initPs2touchpad();
    stream = true;
    }
    //}}}
  else {
    //{{{  sd
    if (SD_present()) {
      int ret = SD_Init();
      lcd->debug ("SDinit " + dec(ret));

      cFatFs* fatFs = cFatFs::create();
      if (fatFs->mount() != FR_OK)
        lcd->debug ("fatFs mount problem");
      else
        lcd->debug ("SD label:" + fatFs->getLabel() + " vsn:" + hex (fatFs->getVolumeSerialNumber()) +
                   " freeSectors:" + dec (fatFs->getFreeSectors()));
      listDirectory ("", "JPG");
      }
    else
      lcd->debug ("no SD card");
    }
    //}}}

  for (auto fileStr : mFileNames) {
    auto t0 = HAL_GetTick();
    //{{{  read file and header
    cFile file (fileStr, FA_OPEN_EXISTING | FA_READ);
    auto buf = (uint8_t*)pvPortMalloc (file.getSize());
    auto bytesRead = 0;
    file.read (buf, file.getSize(), bytesRead);
    //}}}
    auto tRead = HAL_GetTick();
    //{{{  readHeader, calc scale
    cJpegPic* jpeg = new cJpegPic (2, buf);
    jpeg->readHeader();
    auto width = jpeg->getWidth();
    auto height = jpeg->getHeight();

    // calc scale
    auto scaleShift = 0;
    auto scale = 1;
    while ((scaleShift < 3) &&
           ((width / scale > lcd->getLcdWidthPix()) || (height /scale > lcd->getLcdHeightPix()))) {
      scale *= 2;
      scaleShift++;
      }

    width >>= scaleShift;
    height >>= scaleShift;
    //}}}
    auto tHeader = HAL_GetTick();

    lcd->info (fileStr + " sz:" + dec(file.getSize()) + " " + dec(width) + ":" + dec(height) + ">>" + dec(scaleShift));

    auto decodedPic = jpeg->decodeBody (scaleShift);
    auto tDecode = HAL_GetTick();

    delete (jpeg);
    vPortFree (buf);

    lcd->startRender();
    lcd->clear (COL_BLACK);
    lcd->endRender (true);
    auto tRender = HAL_GetTick();

    cLcd::tTile srcTile = {(uint32_t)decodedPic, width, DMA2D_RGB565, 2, 0,0, width, height};
    //cLcd::tTile srcTile = {(uint32_t)piccy, width, DMA2D_RGB888, 3, 0,0, width, height};
    lcd->copy (&srcTile, 0, 0);
    lcd->flush();
    auto tCopy = HAL_GetTick();
    lcd->copy90 (&srcTile, 0, 0);
    lcd->flush();
    auto tCopy90 = HAL_GetTick();
    lcd->sizeCpu (&srcTile, 0, 0, 800, 1280);
    auto tSize = HAL_GetTick();

    lcd->info ("r:" + dec(tRead-t0) +
               " h:" + dec(tHeader-tRead) +
               " d:" + dec(tDecode-tHeader) +
               " rn:" + dec(tRender-tDecode) +
               " c:" + dec(tCopy-tRender) +
               " c90:" + dec(tCopy90-tCopy) +
               " s:" + dec(tSize-tCopy90)
               );
    vPortFree (decodedPic);
    }

  while (true) {
    lcd->startRender();
    lcd->clear (COL_BLACK);
    //std::string str = "x:" + dec(touchX) + " y:" + dec(touchY) + " z:" + dec(touchZ);
    //lcd->text (COL_YELLOW, getFontHeight(), str, 100, 200, lcd->getLcdWidthPix(), getBoxHeight());
    auto x = lcd->getLcdWidthPix() - ((touchY-1300)/4);
    auto y = lcd->getLcdHeightPix() - ((touchX-1300)/4);
    lcd->ellipse (COL_YELLOW, x, y, touchZ, touchZ);
    lcd->endRender (true);
    //uint16_t value = PS2get();
    //char ch = (char)value;
    //std::string charStr (1, ch);
    //std::string releaseStr = (value & 0x100) ? " release " : " ";
    //lcd->info ("key:" + charStr + releaseStr + hex (value));
    }
  }
//}}}
